
export const frcmpRules = [
  { number: "FRCMP Rule 1", type: 'frcmp', title: "Scope and Definitions", description: "Guidelines on the scope and definitions of the rules.<br><br>This rule defines the scope of the Federal Rules of Criminal and Municipal Procedure and provides key definitions used throughout the rules." },
  { number: "FRCMP Rule 2", type: 'frcmp', title: "Purpose and Construction", description: "Guidelines on the purpose and construction of the rules to ensure simplicity, fairness, and the elimination of unjustifiable expense and delay.<br><br>This rule establishes that the rules should be interpreted to ensure just determination, simplicity in procedure, and elimination of unnecessary delay and expense." },
  { number: "FRCMP Rule 3", type: 'frcmp', title: "The Complaint", description: "Guidelines on the complaint process in criminal cases.<br><br>This rule specifies the requirements for filing a criminal complaint, which must be made under oath before a magistrate judge or other authorized officer." },
  { number: "FRCMP Rule 4", type: 'frcmp', title: "Arrest Warrant or Summons", description: "Guidelines on the issuance of an arrest warrant or summons based on a complaint.<br><br>This rule establishes when and how arrest warrants and summons are issued, including requirements for probable cause and content of the warrant or summons." },
  { number: "FRCMP Rule 5", type: 'frcmp', title: "Initial Appearance", description: "Guidelines on the initial appearance of the defendant before the court.<br><br>This rule covers procedures for a defendant's first court appearance, including advice of rights, appointment of counsel, and preliminary matters." },
  { number: "FRCMP Rule 5.1", type: 'frcmp', title: "Preliminary Hearing", description: "Guidelines on the procedures for a preliminary hearing in criminal cases.<br><br>This rule details the timing, procedures, and evidentiary standards for preliminary hearings to determine probable cause." },
  { number: "FRCMP Rule 6", type: 'frcmp', title: "The Grand Jury", description: "Guidelines on the grand jury process and its proceedings.<br><br>This rule governs grand jury procedures, including summoning, composition, secrecy requirements, and proceedings." },
  { number: "FRCMP Rule 7", type: 'frcmp', title: "Indictment and Information", description: "Guidelines on the requirements for the indictment and information in criminal cases.<br><br>This rule sets forth requirements for both indictments and informations, including their use, content, and amendment procedures." },
  { number: "FRCMP Rule 8", type: 'frcmp', title: "Joinder", description: "Guidelines on the joinder of offenses or defendants in criminal cases.<br><br>This rule specifies when multiple offenses or defendants can be charged in a single indictment or tried together." },
  { number: "FRCMP Rule 9", type: 'frcmp', title: "Warrant or Summons", description: "Guidelines on the issuance of an arrest warrant or summons based on an indictment or information.<br><br>This rule establishes procedures for issuing and executing arrest warrants or summons after an indictment or information is filed." },
  { number: "FRCMP Rule 10", type: 'frcmp', title: "Arraignment", description: "Guidelines on the arraignment process for defendants.<br><br>This rule outlines the procedures for conducting arraignments, where defendants are formally called to answer criminal charges." },
  { number: "FRCMP Rule 11", type: 'frcmp', title: "Pleas", description: "Guidelines on the various types of pleas a defendant may enter in a criminal case.<br><br>This rule covers types of pleas (guilty, not guilty, nolo contendere), plea agreements, and required court procedures for accepting pleas." },
  { number: "FRCMP Rule 12", type: 'frcmp', title: "Pleadings and Pretrial Motions", description: "Guidelines on the pleadings and pretrial motions process in criminal cases.<br><br>This rule establishes procedures and timing for pretrial motions, including motions to suppress evidence and defenses." },
  { number: "FRCMP Rule 12.1", type: 'frcmp', title: "Alibi Defense Notice", description: "Guidelines on the notice required for an alibi defense.<br><br>This rule requires defendants to provide advance notice if they intend to present an alibi defense, including details about location and witnesses." },
  { number: "FRCMP Rule 12.2", type: 'frcmp', title: "Insanity Defense Notice", description: "Guidelines on the notice required for an insanity defense and the procedures for a mental examination.<br><br>This rule requires notice of intent to assert an insanity defense and establishes procedures for mental examinations." },
  { number: "FRCMP Rule 12.3", type: 'frcmp', title: "Public-Authority Defense", description: "Guidelines on the notice required for a public-authority defense.<br><br>This rule requires defendants to notify the government if they intend to claim they acted under public authority." },
  { number: "FRCMP Rule 13", type: 'frcmp', title: "Joint Trial", description: "Guidelines on the joint trial of separate cases in criminal proceedings.<br><br>This rule allows the court to order a joint trial of separate cases when the offenses could have been joined in a single indictment." },
  { number: "FRCMP Rule 14", type: 'frcmp', title: "Prejudicial Joinder", description: "Guidelines on relief from prejudicial joinder in criminal cases.<br><br>This rule allows the court to order separate trials of counts or sever defendants' cases if joinder appears prejudicial." },
  { number: "FRCMP Rule 15", type: 'frcmp', title: "Depositions", description: "Guidelines on the use of depositions in criminal cases.<br><br>This rule establishes when and how depositions may be taken and used in criminal cases." },
  { number: "FRCMP Rule 16", type: 'frcmp', title: "Discovery and Inspection", description: "Guidelines on discovery and inspection procedures in criminal cases.<br><br>This rule governs disclosure obligations of both prosecutors and defendants, including evidence, documents, and expert witnesses." },
  { number: "FRCMP Rule 17", type: 'frcmp', title: "Subpoena", description: "Guidelines on the issuance and use of subpoenas in criminal cases.<br><br>This rule covers procedures for issuing subpoenas to compel witness testimony and document production." },
  { number: "FRCMP Rule 17.1", type: 'frcmp', title: "Pretrial Conference", description: "Guidelines on pretrial conferences in criminal cases.<br><br>This rule allows courts to hold conferences to promote fair and efficient trials." },
  { number: "FRCMP Rule 18", type: 'frcmp', title: "Place of Trial", description: "Guidelines on the place of prosecution and trial in criminal cases.<br><br>This rule determines where criminal trials must be held, generally in the district where the offense was committed." },
  { number: "FRCMP Rule 19", type: 'frcmp', title: "Relief from Prosecution", description: "Guidelines on obtaining relief from prosecution in certain circumstances.<br><br>This rule outlines when and how defendants can seek relief from prosecution." },
  { number: "FRCMP Rule 20", type: 'frcmp', title: "Transfer for Plea", description: "Guidelines on the transfer of cases for plea and sentencing purposes.<br><br>This rule allows defendants to plead guilty or nolo contendere and be sentenced in the district where they are arrested." },
  { number: "FRCMP Rule 21", type: 'frcmp', title: "Transfer for Trial", description: "Guidelines on the transfer of cases for trial purposes.<br><br>This rule allows transfer to another district for trial when necessary for fair and impartial proceedings." },
  { number: "FRCMP Rule 22", type: 'frcmp', title: "Motion Timing", description: "Guidelines on the timing of motions in criminal cases.<br><br>This rule establishes when motions must be filed in relation to venue changes and other procedural matters." },
  { number: "FRCMP Rule 23", type: 'frcmp', title: "Jury or Nonjury Trial", description: "Guidelines on the choice between a jury trial and a nonjury trial.<br><br>This rule covers when cases can be tried by jury or by the court alone, including requirements for jury waivers." },
  { number: "FRCMP Rule 24", type: 'frcmp', title: "Trial Jurors", description: "Guidelines on the selection and management of trial jurors.<br><br>This rule governs jury selection, including voir dire, peremptory challenges, and alternate jurors." },
  { number: "FRCMP Rule 25", type: 'frcmp', title: "Judge's Disability", description: "Guidelines on procedures when a judge becomes disabled during a trial.<br><br>This rule provides for replacement of judges who become unable to continue presiding over a trial." },
  { number: "FRCMP Rule 26", type: 'frcmp', title: "Taking Testimony", description: "Guidelines on taking testimony in criminal trials.<br><br>This rule requires testimony to be taken in open court and establishes procedures for witness examination." },
  { number: "FRCMP Rule 26.1", type: 'frcmp', title: "Foreign Law", description: "Guidelines on the determination of foreign law in criminal cases.<br><br>This rule establishes procedures for determining and applying foreign law in criminal proceedings." },
  { number: "FRCMP Rule 27", type: 'frcmp', title: "Official Records", description: "Guidelines on the procedures for proving an official record in criminal cases.<br><br>This rule sets forth methods for proving official records and documents in criminal proceedings." },
  { number: "FRCMP Rule 28", type: 'frcmp', title: "Interpreters", description: "Guidelines on the use of interpreters in criminal cases.<br><br>This rule governs the appointment and use of interpreters to assist non-English speakers and hearing-impaired persons." },
  { number: "FRCMP Rule 29", type: 'frcmp', title: "Acquittal Motion", description: "Guidelines on the procedures for a motion for a judgment of acquittal in criminal cases.<br><br>This rule specifies when and how defendants can move for acquittal based on insufficient evidence." },
  { number: "FRCMP Rule 29.1", type: 'frcmp', title: "Closing Argument", description: "Guidelines on the procedures for closing arguments in criminal trials.<br><br>This rule establishes the order of closing arguments and rebuttal in criminal trials." },
  { number: "FRCMP Rule 30", type: 'frcmp', title: "Jury Instructions", description: "Guidelines on the procedures for giving jury instructions in criminal cases.<br><br>This rule governs how and when jury instructions are requested, given, and objected to during trial." },
  { number: "FRCMP Rule 31", type: 'frcmp', title: "Jury Verdict", description: "Guidelines on the procedures for receiving and recording the jury's verdict in criminal cases.<br><br>This rule covers verdict requirements, polling the jury, and handling multiple defendants or counts." },
  { number: "FRCMP Rule 32", type: 'frcmp', title: "Sentencing and Judgment", description: "Guidelines on the procedures for sentencing and judgment in criminal cases.<br><br>This rule details presentence procedures, sentencing hearings, and judgment requirements." },
  { number: "FRCMP Rule 32.1", type: 'frcmp', title: "Probation/Release Modification", description: "Guidelines on the procedures for revoking or modifying probation or supervised release.<br><br>This rule establishes procedures for modifying, revoking, or terminating probation or supervised release." },
  { number: "FRCMP Rule 32.2", type: 'frcmp', title: "Criminal Forfeiture", description: "Guidelines on the procedures for criminal forfeiture in criminal cases.<br><br>This rule governs procedures for forfeiture of assets connected to criminal activity." },
  { number: "FRCMP Rule 33", type: 'frcmp', title: "New Trial", description: "Guidelines on the procedures for granting a new trial in criminal cases.<br><br>This rule specifies grounds and timing for motions for new trials based on newly discovered evidence or other reasons." },
  { number: "FRCMP Rule 34", type: 'frcmp', title: "Arresting Judgment", description: "Guidelines on the procedures for arresting judgment in criminal cases.<br><br>This rule allows defendants to challenge the court's jurisdiction or the sufficiency of the indictment after conviction." },
  { number: "FRCMP Rule 35", type: 'frcmp', title: "Sentence Correction", description: "Guidelines on correcting or reducing a sentence in criminal cases.<br><br>This rule allows courts to correct clear errors in sentencing or reduce sentences for substantial assistance." },
  { number: "FRCMP Rule 36", type: 'frcmp', title: "Clerical Error", description: "Guidelines on the procedures for correcting clerical errors in criminal cases.<br><br>This rule allows courts to correct clerical errors in the record at any time." },
  { number: "FRCMP Rule 37", type: 'frcmp', title: "Indicative Ruling", description: "Guidelines on the procedures for making indicative rulings on motions for relief barred by pending appeals.<br><br>This rule allows district courts to indicate how they would rule on motions while cases are on appeal." },
  { number: "FRCMP Rule 38", type: 'frcmp', title: "Stay of Sentence", description: "Guidelines on the procedures for staying a sentence or a disability in criminal cases.<br><br>This rule governs when sentences can be stayed pending appeal and procedures for different types of sentences." },
  { number: "FRCMP Rule 39", type: 'frcmp', title: "Release Pending Review", description: "Guidelines on the procedures for releasing a defendant pending review in criminal cases.<br><br>This rule establishes standards and procedures for release while a case is under review." },
  { number: "FRCMP Rule 40", type: 'frcmp', title: "Cross-District Arrest", description: "Guidelines on the procedures for arresting a defendant who fails to appear or violates conditions of release set in another district.<br><br>This rule governs arrests and proceedings when defendants violate conditions in districts other than where they were set." },
  { number: "FRCMP Rule 41", type: 'frcmp', title: "Search and Seizure", description: "Guidelines on the procedures for search and seizure in criminal cases.<br><br>This rule establishes procedures for obtaining and executing search warrants and handling seized property." },
  { number: "FRCMP Rule 42", type: 'frcmp', title: "Criminal Contempt", description: "Guidelines on the procedures for handling criminal contempt cases.<br><br>This rule governs prosecution of criminal contempt, including notice requirements and appointment of prosecutors." },
  { number: "FRCMP Rule 43", type: 'frcmp', title: "Defendant's Presence", description: "Guidelines on when the defendant must be present during criminal proceedings.<br><br>This rule specifies when defendants must be present at criminal proceedings and when their presence can be waived." },
  { number: "FRCMP Rule 44", type: 'frcmp', title: "Right to Counsel", description: "Guidelines on the defendant's right to and appointment of counsel in criminal cases.<br><br>This rule ensures defendants' right to counsel and establishes procedures for appointing counsel for indigent defendants." },
  { number: "FRCMP Rule 45", type: 'frcmp', title: "Time Computation", description: "Guidelines on computing and extending time periods in criminal cases.<br><br>This rule establishes how to calculate deadlines and when courts can extend time periods." },
  { number: "FRCMP Rule 46", type: 'frcmp', title: "Release and Detention", description: "Guidelines on release from custody and supervising detention in criminal cases.<br><br>This rule governs conditions of release, bail, and supervision of detained defendants." },
  { number: "FRCMP Rule 47", type: 'frcmp', title: "Motions and Affidavits", description: "Guidelines on motions and supporting affidavits in criminal cases.<br><br>This rule establishes requirements for filing and supporting motions in criminal proceedings." },
  { number: "FRCMP Rule 48", type: 'frcmp', title: "Dismissal", description: "Guidelines on the procedures for dismissal of charges in criminal cases.<br><br>This rule governs when and how criminal charges can be dismissed by prosecutors or the court." },
  { number: "FRCMP Rule 49", type: 'frcmp', title: "Service and Filing", description: "Guidelines on serving and filing papers in criminal cases.<br><br>This rule establishes procedures for serving and filing documents in criminal proceedings." },
  { number: "FRCMP Rule 49.1", type: 'frcmp', title: "Privacy Protection", description: "Guidelines on protecting privacy for filings made with the court in criminal cases.<br><br>This rule requires redaction of certain personal information in court filings to protect privacy." },
  { number: "FRCMP Rule 50", type: 'frcmp', title: "Prompt Disposition", description: "Guidelines on the prompt disposition of criminal cases.<br><br>This rule promotes speedy resolution of criminal cases and establishes scheduling preferences." },
  { number: "FRCMP Rule 51", type: 'frcmp', title: "Preserving Error", description: "Guidelines on preserving claimed errors in criminal cases.<br><br>This rule explains how to properly object and preserve issues for appeal in criminal proceedings." },
  { number: "FRCMP Rule 52", type: 'frcmp', title: "Error Types", description: "Guidelines on harmless and plain errors in criminal cases.<br><br>This rule defines different types of errors and their effect on criminal proceedings." },
  { number: "FRCMP Rule 53", type: 'frcmp', title: "Broadcasting", description: "Guidelines on broadcasting and recording court proceedings in criminal cases.<br><br>This rule governs when and how court proceedings may be broadcast or recorded." },
  { number: "FRCMP Rule 54", type: 'frcmp', title: "Rule Application", description: "Guidelines on the application of these rules and exceptions in criminal cases.<br><br>This rule specifies when and how the Federal Rules of Criminal Procedure apply." },
  { number: "FRCMP Rule 55", type: 'frcmp', title: "Records", description: "Guidelines on the maintenance and management of records in criminal cases.<br><br>This rule establishes requirements for maintaining court records in criminal proceedings." },
  { number: "FRCMP Rule 56", type: 'frcmp', title: "Summary Judgment", description: "Parties can request a summary judgment when there's no dispute about the important facts, and they're entitled to a judgment as a matter of law.<br><br>This rule establishes procedures for seeking and opposing summary judgment motions." },
  { number: "FRCMP Rule 57", type: 'frcmp', title: "Declaratory Judgment", description: "Provides the procedure for obtaining a declaratory judgment under 28 U.S.C. ยง 2201 and notes that having another adequate remedy doesn't prevent seeking a declaratory judgment.<br><br>This rule governs procedures for seeking declaratory relief in criminal proceedings." },
  { number: "FRCMP Rule 58", type: 'frcmp', title: "Judgment Entry", description: "Judgments must be set out in a separate document and entered promptly by the court clerk under certain conditions, such as jury verdicts or court awards.<br><br>This rule specifies requirements for entering and recording judgments in criminal cases." },
  { number: "FRCMP Rule 59", type: 'frcmp', title: "New Trial/Amendment", description: "Allows the court to grant a new trial or alter/amend a judgment for various reasons, including after jury or nonjury trials. A motion must be filed within 28 days of judgment.<br><br>This rule establishes grounds and procedures for seeking new trials or amendments to judgments." },
  { number: "FRCMP Rule 60", type: 'frcmp', title: "Judgment Relief", description: "Guidelines for obtaining relief from a final judgment or order.<br><br>This rule specifies grounds and procedures for seeking relief from judgments or orders." }
]
