
export const federalLaws = [
  { title: "18 U.S. Code § 2", description: "This section states that anyone who commits an offense against the United States or aids, abets, counsels, commands, induces, or procures its commission is punishable as a principal.<br><br>This section establishes liability for those who assist in federal crimes.", uscode: "18 U.S. Code § 2", category: 'criminal' },
  { title: "18 U.S. Code § 3", description: "This section addresses those who assist an offender after the commission of a crime, with the intent to hinder or prevent their arrest, trial, or punishment.", uscode: "18 U.S. Code § 3", category: 'criminal' },
  { title: "18 U.S. Code § 4", description: "This section criminalizes the act of concealing and not reporting a felony to the authorities.<br><br>This section requires individuals with knowledge of felonies to report them to authorities.", uscode: "18 U.S. Code § 4", category: 'criminal' },
  { title: "18 U.S. Code § 32", description: "This section penalizes the destruction, damage, or disabling of any aircraft, aircraft engine, propeller, or other property or facility used in air commerce.<br><br>This section protects aviation infrastructure and equipment from intentional damage.", uscode: "18 U.S. Code § 32", category: 'criminal' },
  { title: "18 U.S. Code § 33", description: "This section penalizes the destruction or disabling of motor vehicles or motor vehicle facilities, with the intent to endanger safety or with reckless disregard for safety.<br><br>This section protects vehicles and transportation facilities from intentional damage.", uscode: "18 U.S. Code § 33", category: 'criminal' },
  { title: "18 U.S. Code § 34", description: "This section increases the penalty for violations of certain sections when the conduct results in the death of any person.<br><br>This section provides enhanced penalties when criminal conduct causes death.", uscode: "18 U.S. Code § 34", category: 'criminal' },
  { title: "18 U.S. Code § 35", description: "This section penalizes anyone who imparts or conveys false information knowing it to be false, regarding violations related to aircraft and motor vehicle facilities.<br><br>This section protects against false reports that could disrupt transportation safety.", uscode: "18 U.S. Code § 35", category: 'criminal' },
  { title: "18 U.S. Code § 111", description: "This section penalizes assaults, resistance, or impeding of certain officers or employees of the United States while they are engaged in their official duties.<br><br>This section protects federal officers and employees in performance of their duties.", uscode: "18 U.S. Code § 111", category: 'criminal' },
  { title: "18 U.S. Code § 112", description: "This section provides for the protection of foreign officials, official guests, and internationally protected persons from assault, intimidation, or violence.<br><br>This section implements international obligations to protect foreign dignitaries and officials.", uscode: "18 U.S. Code § 112", category: 'criminal' },
  { title: "18 U.S. Code § 113", description: "This section defines and penalizes various forms of assault that occur within the special maritime and territorial jurisdiction of the United States.<br><br>This section extends federal jurisdiction over assaults in maritime and territorial areas.", uscode: "18 U.S. Code § 113", category: 'criminal' },
  { title: "18 U.S. Code § 115", description: "This section penalizes those who threaten, intimidate, or assault the family members of federal officials with the intent to influence or retaliate against the official.<br><br>This section protects family members of federal officials from threats and retaliation.", uscode: "18 U.S. Code § 115", category: 'criminal' },
  { title: "18 U.S. Code § 119", description: "This section provides for the protection of individuals performing certain official duties from threats, harassment, or intimidation.<br><br>This section ensures the safety of individuals carrying out official responsibilities.", uscode: "18 U.S. Code § 119", category: 'criminal' },
  { title: "18 U.S. Code § 201", description: "This section penalizes the bribery of public officials and witnesses, including the act of offering or receiving anything of value to influence official actions.<br><br>This section maintains integrity in government operations and judicial proceedings.", uscode: "18 U.S. Code § 201", category: 'criminal' },
  { title: "18 U.S. Code § 203", description: "This section addresses the compensation of Members of Congress, officers, and others in matters that affect the Government, prohibiting certain types of compensation.<br><br>This section prevents improper financial influence in government matters.", uscode: "18 U.S. Code § 203", category: 'criminal' },
  { title: "18 U.S. Code § 231", description: "This section penalizes acts that obstruct, impede, or interfere with law enforcement officers or firefighters during the performance of their official duties in a civil disorder.<br><br>This section protects law enforcement and emergency responders during civil unrest.", uscode: "18 U.S. Code § 231", category: 'criminal' },
  { title: "18 U.S. Code § 241", description: "This section penalizes conspiracies to injure, oppress, threaten, or intimidate any person in the free exercise of their constitutional rights.<br><br>This section protects individuals' constitutional rights from organized interference.", uscode: "18 U.S. Code § 241", category: 'criminal' },
  { title: "18 U.S. Code § 242", description: "This section penalizes the act of willfully depriving someone of their constitutional rights while acting under the authority of law.<br><br>This section prevents abuse of authority by those acting with legal power.", uscode: "18 U.S. Code § 242", category: 'criminal' },
  { title: "18 U.S. Code § 244", description: "This section penalizes discrimination against individuals wearing the uniform of the armed forces of the United States.<br><br>This section protects service members from discrimination based on their military status.", uscode: "18 U.S. Code § 244", category: 'criminal' },
  { title: "18 U.S. Code § 351", description: "This section provides for the protection of Members of Congress, Cabinet officials, and Supreme Court Justices from assassination, kidnapping, and assault.<br><br>This section protects high-ranking government officials from violent attacks.", uscode: "18 U.S. Code § 351", category: 'criminal' },
  { title: "18 U.S. Code § 371", description: "This section penalizes conspiracies to commit any offense against the United States or to defraud the United States.<br><br>This section addresses organized efforts to commit federal crimes or defraud the government.", uscode: "18 U.S. Code § 371", category: 'criminal' },
  { title: "18 U.S. Code § 372", description: "This section penalizes conspiracies to impede, injure, or intimidate any officer of the United States while engaged in their official duties.<br><br>This section protects federal officers from organized interference or harm.", uscode: "18 U.S. Code § 372", category: 'criminal' },
  { title: "18 U.S. Code § 373", description: "This section penalizes the solicitation of another person to engage in conduct that would constitute a crime of violence.<br><br>This section prevents individuals from encouraging or requesting others to commit violent crimes.", uscode: "18 U.S. Code § 373", category: 'criminal' },
  { title: "18 U.S. Code § 401", description: "This section grants courts the power to punish contempt of their authority, such as misbehavior of any person in their presence or obstructing the administration of justice.<br><br>This section enables courts to maintain order and respect for judicial proceedings.", uscode: "18 U.S. Code § 401", category: 'criminal' },
  { title: "18 U.S. Code § 431", description: "This section prohibits Members of Congress from entering into contracts with the Government.<br><br>This section prevents conflicts of interest in government contracting.", uscode: "18 U.S. Code § 431", category: 'criminal' },
  { title: "18 U.S. Code § 498", description: "This section penalizes the unauthorized use, possession, or distribution of military or naval discharge certificates.<br><br>This section protects the integrity of military service documentation.", uscode: "18 U.S. Code § 498", category: 'criminal' },
  { title: "18 U.S. Code § 499", description: "This section penalizes the unauthorized use, possession, or distribution of military, naval, or official passes.<br><br>This section protects the security of military and official access credentials.", uscode: "18 U.S. Code § 499", category: 'criminal' },
  { title: "18 U.S. Code § 521", description: "This section penalizes individuals who participate in criminal street gangs and engage in certain illegal activities.<br><br>This section addresses organized criminal activity by street gangs.", uscode: "18 U.S. Code § 521", category: 'criminal' },
  { title: "18 U.S. Code § 592", description: "This section prohibits the presence of troops at polling places unless it is necessary to repel armed enemies of the United States.<br><br>This section protects the integrity and civilian nature of elections.", uscode: "18 U.S. Code § 592", category: 'criminal' },
  { title: "18 U.S. Code § 593", description: "This section penalizes interference by armed forces with the conduct of elections.<br><br>This section maintains civilian control over the electoral process.", uscode: "18 U.S. Code § 593", category: 'criminal' },
  { title: "18 U.S. Code § 594", description: "This section penalizes the use of intimidation, threats, or coercion to interfere with the right to vote.<br><br>This section protects voters' rights to cast their ballots free from intimidation.", uscode: "18 U.S. Code § 594", category: 'criminal' },
  { title: "18 U.S. Code § 595", description: "This section penalizes the use of official authority by administrative employees to interfere with or affect elections.<br><br>This section prevents abuse of government positions to influence elections.", uscode: "18 U.S. Code § 595", category: 'criminal' },
  { title: "18 U.S. Code § 599", description: "This section penalizes candidates for making promises of appointment to any public or private position or employment, in exchange for support or votes in any election.<br><br>This section prevents the trading of positions for political support.", uscode: "18 U.S. Code § 599", category: 'criminal' },
  { title: "18 U.S. Code § 600", description: "This section penalizes offering or promising any employment, position, or other benefit as consideration, favor, or reward for political activity.<br><br>This section prevents the exchange of benefits for political support.", uscode: "18 U.S. Code § 600", category: 'criminal' },
  { title: "18 U.S. Code § 606", description: "This section penalizes the intimidation or coercion to secure political contributions.<br><br>This section protects against forced political donations.", uscode: "18 U.S. Code § 606", category: 'criminal' },
  { title: "18 U.S. Code § 610", description: "This section penalizes the use of coercion to interfere with the free exercise of political activity.<br><br>This section protects individuals' freedom to engage in or abstain from political activities.", uscode: "18 U.S. Code § 610", category: 'criminal' },
  { title: "18 U.S. Code § 661", description: "This section defines and penalizes theft within the special maritime and territorial jurisdiction of the United States.<br><br>This section extends federal jurisdiction over theft in maritime and territorial areas.", uscode: "18 U.S. Code § 661", category: 'criminal' },
  { title: "18 U.S. Code § 668", description: "This section penalizes the theft of major artwork from museums, galleries, or other institutions.<br><br>This section protects cultural heritage and valuable art collections.", uscode: "18 U.S. Code § 668", category: 'criminal' },
  { title: "18 U.S. Code § 751", description: "This section penalizes escaping or attempting to escape from the custody of an institution or officer.<br><br>This section maintains the security of correctional facilities and custody arrangements.", uscode: "18 U.S. Code § 751", category: 'criminal' },
  { title: "18 U.S. Code § 752", description: "This section penalizes the aiding or assisting of prisoners in escaping from custody.<br><br>This section prevents external assistance in prison escapes.", uscode: "18 U.S. Code § 752", category: 'criminal' },
  { title: "18 U.S. Code § 755", description: "This section penalizes officers who permit prisoners to escape from their custody.<br><br>This section ensures accountability of officers responsible for prisoner custody.", uscode: "18 U.S. Code § 755", category: 'criminal' },
  { title: "18 U.S. Code § 792", description: "This section penalizes the harboring or concealing of persons who have committed or are about to commit an offense against the United States.<br><br>This section prevents assistance to those who violate federal laws.", uscode: "18 U.S. Code § 792", category: 'criminal' },
  { title: "18 U.S. Code § 793", description: "This section penalizes the unauthorized gathering, transmission, or loss of defense-related information.<br><br>This section protects sensitive national defense information.", uscode: "18 U.S. Code § 793", category: 'criminal' },
  { title: "18 U.S. Code § 798", description: "This section penalizes the unauthorized disclosure of classified information relating to national defense.<br><br>This section safeguards classified national security information.", uscode: "18 U.S. Code § 798", category: 'criminal' },
  { title: "18 U.S. Code § 842", description: "This section penalizes various unlawful acts related to explosives, including their manufacture, distribution, and possession.<br><br>This section regulates the handling and control of explosive materials.", uscode: "18 U.S. Code § 842", category: 'criminal' },
  { title: "18 U.S. Code § 871", description: "This section penalizes threats made against the President, Vice President, or any other officer in the line of succession to the Presidency.<br><br>This section protects the highest offices of the executive branch.", uscode: "18 U.S. Code § 871", category: 'criminal' },
  { title: "18 U.S. Code § 872", description: "This section penalizes extortionate acts committed by officers or employees of the United States.<br><br>This section prevents abuse of federal authority for personal gain.", uscode: "18 U.S. Code § 872", category: 'criminal' },
  { title: "18 U.S. Code § 873", description: "This section penalizes the act of blackmail, which involves obtaining money or other property through coercion or threats.<br><br>This section protects against coercive demands for property or money.", uscode: "18 U.S. Code § 873", category: 'criminal' },
  { title: "18 U.S. Code § 878", description: "This section penalizes threats and acts of extortion against foreign officials, official guests, or internationally protected persons.<br><br>This section protects diplomatic and international relations.", uscode: "18 U.S. Code § 878", category: 'criminal' },
  { title: "18 U.S. Code § 879", description: "This section penalizes threats made against former Presidents, their families, and other specified individuals.<br><br>This section extends protection to former high-ranking officials and their families.", uscode: "18 U.S. Code § 879", category: 'criminal' },
  { title: "18 U.S. Code § 912", description: "This section penalizes impersonating an officer or employee of the United States with the intent to defraud.<br><br>This section protects against fraudulent impersonation of federal officials.", uscode: "18 U.S. Code § 912", category: 'criminal' },
  { title: "18 U.S. Code § 1001", description: "This section penalizes false statements or entries made in any matter within the jurisdiction of the executive, legislative, or judicial branches of the United States.<br><br>This section ensures truthfulness in dealings with the federal government.", uscode: "18 U.S. Code § 1001", category: 'criminal' },
  { title: "18 U.S. Code § 1002", description: "This section penalizes the possession of false papers or documents with the intent to defraud the United States.<br><br>This section prevents the use of fraudulent documents against the government.", uscode: "18 U.S. Code § 1002", category: 'criminal' },
  { title: "18 U.S. Code § 1003", description: "This section penalizes fraudulent demands or claims made against the United States.<br><br>This section protects against false claims for government benefits or payments.", uscode: "18 U.S. Code § 1003", category: 'criminal' },
  { title: "18 U.S. Code § 1016", description: "This section penalizes false acknowledgment of appearance or oath in any matter within the jurisdiction of the United States.<br><br>This section ensures the integrity of official oaths and appearances.", uscode: "18 U.S. Code § 1016", category: 'criminal' },
  { title: "18 U.S. Code § 1017", description: "This section penalizes the wrongful use of government seals or the wrongful sealing of instruments.<br><br>This section protects the integrity of government seals and instruments.", uscode: "18 U.S. Code § 1017", category: 'criminal' },
  { title: "18 U.S. Code § 1018", description: "This section penalizes false or fraudulent official certificates or writings issued by United States officers.<br><br>This section ensures the authenticity of official documents.", uscode: "18 U.S. Code § 1018", category: 'criminal' },
  { title: "18 U.S. Code § 1022", description: "This section penalizes fraudulent representations made about the receipt of military decorations or medals.<br><br>This section protects the honor and integrity of military awards.", uscode: "18 U.S. Code § 1022", category: 'criminal' },
  { title: "18 U.S. Code § 1031", description: "This section penalizes major fraud committed against the United States, particularly in connection with government contracts.<br><br>This section protects against significant financial fraud in government dealings.", uscode: "18 U.S. Code § 1031", category: 'criminal' },
  { title: "18 U.S. Code § 1038", description: "This section penalizes the provision of false information and the perpetuation of hoaxes related to criminal activities.<br><br>This section prevents the spread of false information that could cause public alarm or waste law enforcement resources.", uscode: "18 U.S. Code § 1038", category: 'criminal' },
  { title: "18 U.S. Code § 1071", description: "This section penalizes the act of concealing a person from arrest, knowing that a warrant has been issued for their apprehension.<br><br>This section ensures cooperation with law enforcement in apprehending wanted individuals.", uscode: "18 U.S. Code § 1071", category: 'criminal' },
  { title: "18 U.S. Code § 1072", description: "This section penalizes the act of concealing an escaped prisoner, knowing that they have escaped from custody.<br><br>This section helps maintain the integrity of the correctional system.", uscode: "18 U.S. Code § 1072", category: 'criminal' },
  { title: "18 U.S. Code § 1111", description: "This section defines and penalizes the crime of murder within the special maritime and territorial jurisdiction of the United States.<br><br>This section addresses the most serious crime against human life.", uscode: "18 U.S. Code § 1111", category: 'criminal' },
  { title: "18 U.S. Code § 1112", description: "This section defines and penalizes the crime of manslaughter within the special maritime and territorial jurisdiction of the United States.<br><br>This section addresses unlawful killings without malice aforethought.", uscode: "18 U.S. Code § 1112", category: 'criminal' },
  { title: "18 U.S. Code § 1113", description: "This section penalizes attempts to commit murder or manslaughter within the special maritime and territorial jurisdiction of the United States.<br><br>This section addresses unsuccessful attempts to take human life.", uscode: "18 U.S. Code § 1113", category: 'criminal' },
  { title: "18 U.S. Code § 1114", description: "This section provides for the protection of officers and employees of the United States from murder, manslaughter, and other forms of assault.<br><br>This section ensures the safety of federal personnel in performing their duties.", uscode: "18 U.S. Code § 1114", category: 'criminal' },
  { title: "18 U.S. Code § 1116", description: "This section provides for the protection of foreign officials, official guests, and internationally protected persons from murder or manslaughter.<br><br>This section upholds international diplomatic protections.", uscode: "18 U.S. Code § 1116", category: 'criminal' },
  { title: "18 U.S. Code § 1117", description: "This section penalizes conspiracies to commit murder within the special maritime and territorial jurisdiction of the United States.<br><br>This section addresses planned but not yet executed murders.", uscode: "18 U.S. Code § 1117", category: 'criminal' },
  { title: "18 U.S. Code § 1118", description: "This section penalizes the act of murder committed by a Federal prisoner.<br><br>This section addresses violent crimes committed by those already in federal custody.", uscode: "18 U.S. Code § 1118", category: 'criminal' },
  { title: "18 U.S. Code § 1120", description: "This section penalizes the act of murder committed by escaped prisoners.<br><br>This section addresses violent crimes committed by those who have escaped custody.", uscode: "18 U.S. Code § 1120", category: 'criminal' },
  { title: "18 U.S. Code § 1121", description: "This section penalizes the killing of persons aiding Federal investigations or State correctional officers.<br><br>This section protects those who assist in law enforcement and corrections.", uscode: "18 U.S. Code § 1121", category: 'criminal' },
  { title: "18 U.S. Code § 1201", description: "This section penalizes the act of kidnapping within the special maritime and territorial jurisdiction of the United States.<br><br>This section protects against unlawful detention and transportation of persons.", uscode: "18 U.S. Code § 1201", category: 'criminal' },
  { title: "18 U.S. Code § 1203", description: "This section penalizes the act of taking hostages, particularly when it involves a threat to kill, injure, or continue to detain the hostages to compel an act.<bact.<br><br>This section addresses coercive detention of persons to force actions by others.", uscode: "18 U.S. Code § 1203", category: 'criminal' },
  { title: "18 U.S. Code § 1381", description: "This section penalizes acts that entice desertion or harbor deserters from the armed forces of the United States.<br><br>This section maintains military discipline and readiness.", uscode: "18 U.S. Code § 1381", category: 'criminal' },
  { title: "18 U.S. Code § 1382", description: "This section penalizes unauthorized entry into military, naval, or Coast Guard property.<br><br>This section protects the security of military installations.", uscode: "18 U.S. Code § 1382", category: 'criminal' },
  { title: "18 U.S. Code § 1389", description: "This section penalizes any attacks against United States persons with the intent to harm or kill them.<br><br>This section protects U.S. persons from targeted violence.", uscode: "18 U.S. Code § 1389", category: 'criminal' },
  { title: "18 U.S. Code § 1503", description: "This section penalizes acts that influence, intimidate, or injure officers or jurors in relation to their official duties.<br><br>This section protects the integrity of judicial proceedings.", uscode: "18 U.S. Code § 1503", category: 'criminal' },
  { title: "18 U.S. Code § 1504", description: "This section penalizes the act of influencing a juror by writing, in relation to any matter pending before them.<br><br>This section prevents improper written communication with jurors.", uscode: "18 U.S. Code § 1504", category: 'criminal' },
  { title: "18 U.S. Code § 1505", description: "This section penalizes acts that obstruct the proceedings of any department, agency, or committee of the United States.<br><br>This section ensures the proper functioning of federal administrative processes.", uscode: "18 U.S. Code § 1505", category: 'criminal' },
  { title: "18 U.S. Code § 1506", description: "This section penalizes the theft, alteration, or falsification of records or processes, and the provision of false bail.<br><br>This section protects the integrity of court records and bail proceedings.", uscode: "18 U.S. Code § 1506", category: 'criminal' },
  { title: "18 U.S. Code § 1509", description: "This section penalizes acts that obstruct the execution of court orders.<br><br>This section ensures compliance with judicial authority.", uscode: "18 U.S. Code § 1509", category: 'criminal' },
  { title: "18 U.S. Code § 1510", description: "This section penalizes acts that obstruct criminal investigations conducted by the United States.<br><br>This section protects the integrity of federal criminal investigations.", uscode: "18 U.S. Code § 1510", category: 'criminal' },
  { title: "18 U.S. Code § 1511", description: "This section penalizes acts that obstruct law enforcement officers of State or local governments in the performance of their duties.<br><br>This section supports state and local law enforcement effectiveness.", uscode: "18 U.S. Code § 1511", category: 'criminal' },
  { title: "18 U.S. Code § 1512", description: "This section penalizes acts that tamper with a witness, victim, or informant to influence their testimony or prevent them from attending an official proceeding.<br><br>This section protects those who participate in the justice system.", uscode: "18 U.S. Code § 1512", category: 'criminal' },
  { title: "18 U.S. Code § 1513", description: "This section penalizes acts that retaliate against a witness, victim, or informant for providing information or testimony in an official proceeding.<br><br>This section protects those who assist in the administration of justice from reprisal.", uscode: "18 U.S. Code § 1513", category: 'criminal' },
  { title: "18 U.S. Code § 1519", description: "This section penalizes the destruction, alteration, or falsification of records in relation to Federal investigations or bankruptcy cases.<br><br>This section preserves evidence integrity in federal proceedings.", uscode: "18 U.S. Code § 1519", category: 'criminal' },
  { title: "18 U.S. Code § 1521", description: "This section penalizes acts of retaliation against Federal judges or law enforcement officers by filing false claims or slandering their title.<br><br>This section protects federal officials from retaliatory legal harassment.", uscode: "18 U.S. Code § 1521", category: 'criminal' },
  { title: "18 U.S. Code § 1621", description: "This section penalizes the act of perjury, which involves willfully giving false testimony under oath in relation to a matter pending before a court or other tribunal.<br><br>This section ensures truthfulness in sworn testimony.", uscode: "18 U.S. Code § 1621", category: 'criminal' },
  { title: "18 U.S. Code § 1622", description: "This section penalizes the act of procuring someone else to commit perjury.<br><br>This section prevents the inducement of false testimony.", uscode: "18 U.S. Code § 1622", category: 'criminal' },
  { title: "18 U.S. Code § 1623", description: "This section penalizes making false declarations before a grand jury or court.<br><br>This section ensures truthful testimony in formal legal proceedings.", uscode: "18 U.S. Code § 1623", category: 'criminal' },
  { title: "18 U.S. Code § 1751", description: "This section provides for the protection of the President and Vice President from assassination, kidnapping, and assault.<br><br>This section ensures the safety of the nation's highest executive officers.", uscode: "18 U.S. Code § 1751", category: 'criminal' },
  { title: "18 U.S. Code § 1752", description: "This section penalizes unauthorized entry or remaining in any restricted building or grounds.<br><br>This section protects sensitive government facilities and their occupants.", uscode: "18 U.S. Code § 1752", category: 'criminal' },
  { title: "18 U.S. Code § 1791", description: "This section penalizes the provision or possession of contraband in prison facilities.<br><br>This section maintains prison security and safety.", uscode: "18 U.S. Code § 1791", category: 'criminal' },
  { title: "18 U.S. Code § 1792", description: "This section penalizes acts of mutiny or riots within prison facilities.<br><br>This section maintains order and control in correctional facilities.", uscode: "18 U.S. Code § 1792", category: 'criminal' },
  { title: "18 U.S. Code § 1793", description: "This section penalizes unauthorized entry onto a Bureau of Prisons reservation.<br><br>This section protects the security perimeter of federal prison facilities.", uscode: "18 U.S. Code § 1793", category: 'criminal' },
  { title: "18 U.S. Code § 1905", description: "This section penalizes the unauthorized disclosure of confidential information.<br><br>This section protects sensitive government and private information from unauthorized disclosure.", uscode: "18 U.S. Code § 1905", category: 'criminal' },
  { title: "18 U.S. Code § 1918", description: "This section penalizes acts of disloyalty and asserting the right to strike against the Government.<br><br>This section maintains continuity of government operations.", uscode: "18 U.S. Code § 1918", category: 'criminal' },
  { title: "18 U.S. Code § 2076", description: "This section defines the duties and penalties related to the office of the clerk of court.<br><br>This section ensures proper administration of court records and proceedings.", uscode: "18 U.S. Code § 2076", category: 'criminal' },
  { title: "18 U.S. Code § 2101", description: "This section penalizes acts of inciting, organizing, promoting, or participating in riots.<br><br>This section maintains public order and safety.", uscode: "18 U.S. Code § 2101", category: 'criminal' },
  { title: "18 U.S. Code § 2111", description: "This section defines and penalizes robbery within the special maritime and territorial jurisdiction of the United States.<br><br>This section extends federal authority over crimes in special jurisdictions.", uscode: "18 U.S. Code § 2111", category: 'criminal' },
  { title: "18 U.S. Code § 2113", description: "This section penalizes bank robbery and related crimes.<br><br>This section protects financial institutions from theft and related violence.", uscode: "18 U.S. Code § 2113", category: 'criminal' },
  { title: "18 U.S. Code § 2119", description: "This section penalizes carjacking and the use of force, violence, or intimidation to take a motor vehicle from the person or presence of another.<br><br>This section addresses violent vehicle theft.", uscode: "18 U.S. Code § 2119", category: 'criminal' },
  { title: "18 U.S. Code § 2231", description: "This section penalizes assaults on federal officers while they are engaged in or on account of the performance of official duties.<br><br>This section protects federal officers in the performance of their duties.", uscode: "18 U.S. Code § 2231", category: 'criminal' },
  { title: "18 U.S. Code § 2235", description: "This section penalizes the procurement of a search warrant without probable cause.<br><br>This section protects against improper searches and seizures.", uscode: "18 U.S. Code § 2235", category: 'criminal' },
  { title: "18 U.S. Code § 2236", description: "This section penalizes the procurement of a seizure warrant without probable cause.<br><br>This section ensures proper legal basis for property seizures.", uscode: "18 U.S. Code § 2236", category: 'criminal' },
  { title: "18 U.S. Code § 2315", description: "This section penalizes the receipt, possession, concealment, storage, barter, sale, or disposition of stolen property.<br><br>This section deters trafficking in stolen goods.", uscode: "18 U.S. Code § 2315", category: 'criminal' },
  { title: "18 U.S. Code § 2381", description: "This section penalizes acts of treason against the United States, including levying war against the country or aiding its enemies.<br><br>This section addresses the most serious crimes against national security.", uscode: "18 U.S. Code § 2381", category: 'criminal' },
  { title: "18 U.S. Code § 2382", description: "This section penalizes the failure to report knowledge of treason to appropriate authorities.<br><br>This section ensures prompt reporting of treasonous activities.", uscode: "18 U.S. Code § 2382", category: 'criminal' },
  { title: "18 U.S. Code § 2383", description: "This section penalizes engaging in rebellion or insurrection against the authority of the United States.<br><br>This section protects against violent opposition to government authority.", uscode: "18 U.S. Code § 2383", category: 'criminal' },
  { title: "18 U.S. Code § 2384", description: "This section penalizes conspiracies to overthrow, put down, or destroy by force the government of the United States.<br><br>This section protects against organized attempts to overthrow the government.", uscode: "18 U.S. Code § 2384", category: 'criminal' },
  { title: "18 U.S. Code § 2387", description: "This section penalizes acts intended to interfere with, impair, or influence the loyalty or discipline of the armed forces of the United States.<br><br>This section maintains military discipline and readiness.", uscode: "18 U.S. Code § 2387", category: 'criminal' },
  { title: "18 U.S. Code § 2388", description: "This section penalizes activities intended to interfere with or impede the armed forces during times of war.<br><br>This section protects military effectiveness during wartime.", uscode: "18 U.S. Code § 2388", category: 'criminal' },
  { title: "18 U.S. Code § 2389", description: "This section penalizes recruiting for or enlisting in the armed forces of a foreign government engaged in armed conflict with the United States.<br><br>This section prevents support of enemy forces during conflict.", uscode: "18 U.S. Code § 2389", category: 'criminal' },
  { title: "18 U.S. Code § 2390", description: "This section penalizes enlisting to serve against the United States in an armed conflict.<br><br>This section prevents citizens from joining enemy forces.", uscode: "18 U.S. Code § 2390", category: 'criminal' },
  { title: "18 U.S. Code § 2441", description: "This section penalizes violations of the laws of war, including crimes such as torture, genocide, and other war crimes.<br><br>This section enforces international humanitarian law and military justice.", uscode: "18 U.S. Code § 2441", category: 'criminal' }
]
